export type tGroup = {
    "id": number,
    "Группа": string | number,
    "Минимальная цена": number ,
    "Максимальная цена": number ,
    "Средняя цена": number,
}[];

export const  countries: tGroup = [
    { "id": 1, "Группа": 2022, "Минимальная цена": 2099.99, "Максимальная цена": 2099.99, "Средняя цена": 2099.99 },
    { "id": 2, "Группа": 2021, "Минимальная цена": 1199.99, "Максимальная цена": 2631.2, "Средняя цена": 1915.40 },
    { "id": 3, "Группа": 2020, "Минимальная цена": 719.99, "Максимальная цена": 4999.99, "Средняя цена": 2864.99 },
    { "id": 4, "Группа": 2019, "Минимальная цена": 528.89, "Максимальная цена": 1899.95, "Средняя цена": 1214.42 },
    { "id": 5, "Группа": 2018, "Минимальная цена": 633.03, "Максимальная цена": 6300, "Средняя цена": 3466.01 },
    { "id": 6, "Группа": 2017, "Минимальная цена": 604.15, "Максимальная цена": 8999, "Средняя цена": 4801.58 },
    { "id": 7, "Группа": 2016, "Минимальная цена": 442.79, "Максимальная цена": 4999.99, "Средняя цена": 2721.39 }
];


export const years: tGroup = [
    {
        "id": 1,
        "Группа": "Desktop",
        "Минимальная цена": 329,
        "Максимальная цена": 2099.99,
        "Средняя цена": 934.47
    },
    {
        "id": 2,
        "Группа": "Mobile",
        "Минимальная цена": 1299.99,
        "Максимальная цена": 1999.99,
        "Средняя цена": 1599.99
    },
    {
        "id": 3,
        "Группа": "Workstation",
        "Минимальная цена": 899,
        "Максимальная цена": 8999,
        "Средняя цена": 3997.29
    }
];

export const types: tGroup = [
    {
        "id": 1,
        "Группа": "High-End",
        "Минимальная цена": 350,
        "Максимальная цена": 2099.99,
        "Средняя цена": 1078.23
    },
    {
        "id": 2,
        "Группа": "Mid-Range",
        "Минимальная цена": 329,
        "Максимальная цена": 799.99,
        "Средняя цена": 584.99
    },
    {
        "id": 3,
        "Группа": "Professional",
        "Минимальная цена": 899,
        "Максимальная цена": 8999,
        "Средняя цена": 3997.29
    },
    {
        "id": 4,
        "Группа": "Gaming",
        "Минимальная цена": 1299.99,
        "Максимальная цена": 1999.99,
        "Средняя цена": 1599.99
    }
];