const buildings = [
    {
        "Название": "GeForce RTX 3090 Ti",
        "G3Dmark": 29094,
        "Цена": 2099.99,
        "Эффективность": 64.65,
        "Год": 2022,
        "Категория": "Desktop",
        "Саб Категория": "High-End"
    },
    {
        "Название": "GeForce RTX 3080 Ti",
        "G3Dmark": 26887,
        "Цена": 1199.99,
        "Эффективность": 76.82,
        "Год": 2021,
        "Категория": "Desktop",
        "Саб Категория": "High-End"
    },
    {
        "Название": "GeForce RTX 3090",
        "G3Dmark": 26395,
        "Цена": 1749.99,
        "Эффективность": 75.41,
        "Год": 2020,
        "Категория": "Desktop",
        "Саб Категория": "High-End"
    },
    {
        "Название": "Radeon RX 6900 XT",
        "G3Dmark": 25458,
        "Цена": 1120.31,
        "Эффективность": 84.86,
        "Год": 2020,
        "Категория": "Desktop",
        "Саб Категория": "High-End"
    },
    {
        "Название": "GeForce RTX 3080",
        "G3Dmark": 24853,
        "Цена": 999,
        "Эффективность": 77.66,
        "Год": 2020,
        "Категория": "Desktop",
        "Саб Категория": "High-End"
    },
    {
        "Название": "GeForce RTX 3070 Ti",
        "G3Dmark": 23367,
        "Цена": 749.99,
        "Эффективность": 80.58,
        "Год": 2021,
        "Категория": "Desktop",
        "Саб Категория": "Mid-Range"
    },
    {
        "Название": "Radeon RX 6800 XT",
        "G3Dmark": 23364,
        "Цена": 859,
        "Эффективность": 77.88,
        "Год": 2020,
        "Категория": "Desktop",
        "Саб Категория": "High-End"
    },
    {
        "Название": "RTX A5000",
        "G3Dmark": 22867,
        "Цена": 2631.2,
        "Эффективность": 99.42,
        "Год": 2021,
        "Категория": "Workstation",
        "Саб Категория": "Professional"
    },
    {
        "Название": "RTX A6000",
        "G3Dmark": 22122,
        "Цена": 4999.99,
        "Эффективность": 73.74,
        "Год": 2020,
        "Категория": "Workstation",
        "Саб Категория": "Professional"
    },
    {
        "Название": "GeForce RTX 3070",
        "G3Dmark": 22093,
        "Цена": 719.99,
        "Эффективность": 100.42,
        "Год": 2020,
        "Категория": "Desktop",
        "Саб Категория": "Mid-Range"
    },
    {
        "Название": "GeForce RTX 2080 Ti",
        "G3Dmark": 21796,
        "Цена": 998.59,
        "Эффективность": 87.18,
        "Год": 2018,
        "Категория": "Desktop",
        "Саб Категория": "High-End"
    },
    {
        "Название": "RTX A4500",
        "G3Dmark": 21546,
        "Цена": 2134.64,
        "Эффективность": 107.73,
        "Год": 2021,
        "Категория": "Workstation",
        "Саб Категория": "Professional"
    },
    {
        "Название": "Radeon RX 6800",
        "G3Dmark": 20667,
        "Цена": 758.99,
        "Эффективность": 82.67,
        "Год": 2020,
        "Категория": "Desktop",
        "Саб Категория": "Mid-Range"
    },
    {
        "Название": "GeForce RTX 3060 Ti",
        "G3Dmark": 20206,
        "Цена": 599.99,
        "Эффективность": 101.03,
        "Год": 2020,
        "Категория": "Desktop",
        "Саб Категория": "Mid-Range"
    },
    {
        "Название": "TITAN RTX",
        "G3Dmark": 20169,
        "Цена": 2794.99,
        "Эффективность": 72.03,
        "Год": 2018,
        "Категория": "Workstation",
        "Саб Категория": "Professional"
    },
    {
        "Название": "Quadro RTX 6000",
        "G3Dmark": 19692,
        "Цена": 6300,
        "Эффективность": 66.75,
        "Год": 2018,
        "Категория": "Workstation",
        "Саб Категория": "Professional"
    },
    {
        "Название": "GeForce RTX 2080 SUPER",
        "G3Dmark": 19519,
        "Цена": 683.99,
        "Эффективность": 78.08,
        "Год": 2019,
        "Категория": "Desktop",
        "Саб Категория": "High-End"
    },
    {
        "Название": "TITAN Xp",
        "G3Dmark": 19508,
        "Цена": 1645,
        "Эффективность": 78.03,
        "Год": 2017,
        "Категория": "Desktop",
        "Саб Категория": "High-End"
    },
    {
        "Название": "GeForce RTX 3080 Ti Laptop GPU",
        "G3Dmark": 19507,
        "Цена": 1999.99,
        "Эффективность": 130.05,
        "Год": 2021,
        "Категория": "Mobile",
        "Саб Категория": "Gaming"
    },
    {
        "Название": "Quadro RTX 8000",
        "G3Dmark": 19126,
        "Цена": 4741.49,
        "Эффективность": 73.56,
        "Год": 2018,
        "Категория": "Workstation",
        "Саб Категория": "Professional"
    },
    {
        "Название": "Radeon RX 6700 XT",
        "G3Dmark": 18993,
        "Цена": 529.99,
        "Эффективность": 82.58,
        "Год": 2021,
        "Категория": "Desktop",
        "Саб Категория": "Mid-Range"
    },
    {
        "Название": "RTX A4000",
        "G3Dmark": 18988,
        "Цена": 1233.98,
        "Эффективность": 135.63,
        "Год": 2021,
        "Категория": "Workstation",
        "Саб Категория": "Professional"
    },
    {
        "Название": "TITAN V",
        "G3Dmark": 18816,
        "Цена": 1999.99,
        "Эффективность": 75.26,
        "Год": 2017,
        "Категория": "Desktop",
        "Саб Категория": "High-End"
    },
    {
        "Название": "Radeon PRO W6800",
        "G3Dmark": 18802,
        "Цена": 2194.99,
        "Эффективность": 75.21,
        "Год": 2021,
        "Категория": "Workstation",
        "Саб Категория": "Professional"
    },
    {
        "Название": "GeForce RTX 2080",
        "G3Dmark": 18732,
        "Цена": 633.03,
        "Эффективность": 74.93,
        "Год": 2018,
        "Категория": "Desktop",
        "Саб Категория": "High-End"
    },
    {
        "Название": "TITAN Xp COLLECTORS EDITION",
        "G3Dmark": 18721,
        "Цена": 1999.99,
        "Эффективность": 74.89,
        "Год": 2017,
        "Категория": "Desktop",
        "Саб Категория": "High-End"
    },
    {
        "Название": "GeForce RTX 3070 Ti Laptop GPU",
        "G3Dmark": 18490,
        "Цена": 1499.99,
        "Эффективность": 147.92,
        "Год": 2021,
        "Категория": "Mobile",
        "Саб Категория": "Gaming"
    },
    {
        "Название": "GeForce GTX 1080 Ti",
        "G3Dmark": 18284,
        "Цена": 604.15,
        "Эффективность": 73.14,
        "Год": 2017,
        "Категория": "Desktop",
        "Саб Категория": "High-End"
    },
    {
        "Название": "NVIDIA TITAN Xp",
        "G3Dmark": 18280,
        "Цена": 1645,
        "Эффективность": 73.12,
        "Год": 2017,
        "Категория": "Desktop",
        "Саб Категория": "High-End"
    },
    {
        "Название": "GeForce RTX 2070 SUPER",
        "G3Dmark": 18168,
        "Цена": 613.8,
        "Эффективность": 84.5,
        "Год": 2019,
        "Категория": "Desktop",
        "Саб Категория": "Mid-Range"
    },
    {
        "Название": "Quadro GV100",
        "G3Dmark": 17675,
        "Цена": 8999,
        "Эффективность": 70.7,
        "Год": 2017,
        "Категория": "Workstation",
        "Саб Категория": "Professional"
    },
    {
        "Название": "TITAN V CEO Edition",
        "G3Dmark": 16988,
        "Цена": 2499.99,
        "Эффективность": 67.95,
        "Год": 2017,
        "Категория": "Desktop",
        "Саб Категория": "High-End"
    },
    {
        "Название": "GeForce RTX 3060",
        "G3Dmark": 16958,
        "Цена": 329,
        "Эффективность": 99.76,
        "Год": 2021,
        "Категория": "Desktop",
        "Саб Категория": "Mid-Range"
    },
    {
        "Название": "Radeon RX 5700 XT",
        "G3Dmark": 16892,
        "Цена": 694.94,
        "Эффективность": 75.08,
        "Год": 2019,
        "Категория": "Desktop",
        "Саб Категория": "Mid-Range"
    },
    {
        "Название": "Radeon Pro VII",
        "G3Dmark": 16853,
        "Цена": 1799.99,
        "Эффективность": 67.41,
        "Год": 2020,
        "Категория": "Workstation",
        "Саб Категория": "Professional"
    },
    {
        "Название": "Radeon VII",
        "G3Dmark": 16767,
        "Цена": 1899.95,
        "Эффективность": 55.89,
        "Год": 2019,
        "Категория": "Desktop",
        "Саб Категория": "High-End"
    },
    {
        "Название": "Radeon RX 5700 XT 50th Anniversary",
        "G3Dmark": 16650,
        "Цена": 799.99,
        "Эффективность": 70.85,
        "Год": 2019,
        "Категория": "Desktop",
        "Саб Категория": "Mid-Range"
    },
    {
        "Название": "GeForce RTX 3080 Laptop GPU",
        "G3Dmark": 16522,
        "Цена": 1799.99,
        "Эффективность": 143.67,
        "Год": 2021,
        "Категория": "Mobile",
        "Саб Категория": "Gaming"
    },
    {
        "Название": "GeForce RTX 2060 SUPER",
        "G3Dmark": 16514,
        "Цена": 528.89,
        "Эффективность": 94.37,
        "Год": 2019,
        "Категория": "Desktop",
        "Саб Категория": "Mid-Range"
    },
    {
        "Название": "RTX A4000 Laptop GPU",
        "G3Dmark": 16297,
        "Цена": 1499.99,
        "Эффективность": 116.41,
        "Год": 2021,
        "Категория": "Mobile",
        "Саб Категория": "Professional"
    },
    {
        "Название": "RTX A5000 Laptop GPU",
        "G3Dmark": 16273,
        "Цена": 1999.99,
        "Эффективность": 98.62,
        "Год": 2021,
        "Категория": "Mobile",
        "Саб Категория": "Professional"
    },
    {
        "Название": "Quadro RTX 5000",
        "G3Dmark": 16260,
        "Цена": 2499.99,
        "Эффективность": 70.7,
        "Год": 2018,
        "Категория": "Workstation",
        "Саб Категория": "Professional"
    },
    {
        "Название": "Tesla V100-SXM2-16GB",
        "G3Dmark": 16235,
        "Цена": 7999.99,
        "Эффективность": 85.42,
        "Год": 2017,
        "Категория": "Workstation",
        "Саб Категория": "Professional"
    },
    {
        "Название": "Quadro GP100",
        "G3Dmark": 16203,
        "Цена": 4999.99,
        "Эффективность": 68.95,
        "Год": 2016,
        "Категория": "Workstation",
        "Саб Категория": "Professional"
    },
    {
        "Название": "GeForce RTX 2070",
        "G3Dmark": 16079,
        "Цена": 627.44,
        "Эффективность": 91.88,
        "Год": 2018,
        "Категория": "Desktop",
        "Саб Категория": "Mid-Range"
    },
    {
        "Название": "Radeon RX 6600 XT",
        "G3Dmark": 15853,
        "Цена": 399.99,
        "Эффективность": 99.08,
        "Год": 2021,
        "Категория": "Desktop",
        "Саб Категория": "Mid-Range"
    },
    {
        "Название": "Quadro P6000",
        "G3Dmark": 15811,
        "Цена": 3250,
        "Эффективность": 63.25,
        "Год": 2016,
        "Категория": "Workstation",
        "Саб Категория": "Professional"
    },
    {
        "Название": "Quadro RTX 4000",
        "G3Dmark": 15515,
        "Цена": 899,
        "Эффективность": 96.97,
        "Год": 2018,
        "Категория": "Workstation",
        "Саб Категория": "Professional"
    },
    {
        "Название": "GeForce GTX 1080",
        "G3Dmark": 15265,
        "Цена": 442.79,
        "Эффективность": 84.8,
        "Год": 2016,
        "Категория": "Desktop",
        "Саб Категория": "High-End"
    },
    {
        "Название": "GeForce RTX 3070 Laptop GPU",
        "G3Dmark": 15231,
        "Цена": 1299.99,
        "Эффективность": 132.44,
        "Год": 2021,
        "Категория": "Mobile",
        "Саб Категория": "Gaming"
    },
    {
        "Название": "GeForce RTX 2080 (Mobile)",
        "G3Dmark": 15107,
        "Цена": 1499.99,
        "Эффективность": 100.71,
        "Год": 2018,
        "Категория": "Mobile",
        "Саб Категория": "Gaming"
    },
    {
        "Название": "Radeon Pro W5700",
        "G3Dmark": 15085,
        "Цена": 1649.99,
        "Эффективность": 73.59,
        "Год": 2019,
        "Категория": "Workstation",
        "Саб Категория": "Professional"
    },
    {
        "Название": "Quadro RTX 5000 (Mobile)",
        "G3Dmark": 14832,
        "Цена": 1999.99,
        "Эффективность": 134.84,
        "Год": 2019,
        "Категория": "Mobile",
        "Саб Категория": "Professional"
    },
    {
        "Название": "Radeon RX 5700",
        "G3Dmark": 14729,
        "Цена": 899.95,
        "Эффективность": 81.83,
        "Год": 2019,
        "Категория": "Desktop",
        "Саб Категория": "Mid-Range"
    },
    {
        "Название": "Radeon RX Vega 64",
        "G3Dmark": 14636,
        "Цена": 799.99,
        "Эффективность": 49.62,
        "Год": 2017,
        "Категория": "Desktop",
        "Саб Категория": "High-End"
    },
    {
        "Название": "GeForce GTX 1070 Ti",
        "G3Dmark": 14500,
        "Цена": 389,
        "Эффективность": 80.56,
        "Год": 2017,
        "Категория": "Desktop",
        "Саб Категория": "Mid-Range"
    },
    {
        "Название": "GeForce RTX 2070 Super with Max-Q Design",
        "G3Dmark": 14261,
        "Цена": 1499.99,
        "Эффективность": 178.27,
        "Год": 2019,
        "Категория": "Mobile",
        "Саб Категория": "Gaming"
    },
    {
        "Название": "Radeon PRO W6600",
        "G3Dmark": 14212,
        "Цена": 899.99,
        "Эффективность": 85.42,
        "Год": 2021,
        "Категория": "Workstation",
        "Саб Категория": "Professional"
    },
    {
        "Название": "Radeon Pro WX 8200",
        "G3Dmark": 14110,
        "Цена": 1599.39,
        "Эффективность": 61.35,
        "Год": 2018,
        "Категория": "Workstation",
        "Саб Категория": "Professional"
    },
    {
        "Название": "GeForce RTX 2080 Super with Max-Q Design",
        "G3Dmark": 14020,
        "Цена": 1499.99,
        "Эффективность": 175.24,
        "Год": 2019,
        "Категория": "Mobile",
        "Саб Категория": "Gaming"
    },
    {
        "Название": "GeForce RTX 2060",
        "G3Dmark": 13953,
        "Цена": 389.99,
        "Эффективность": 87.2,
        "Год": 2019,
        "Категория": "Desktop",
        "Саб Категория": "Mid-Range"
    },
    {
        "Название": "Quadro RTX 5000 with Max-Q Design",
        "G3Dmark": 13893,
        "Цена": 1999.99,
        "Эффективность": 173.66,
        "Год": 2019,
        "Категория": "Mobile",
        "Саб Категория": "Professional"
    },
    {
        "Название": "GeForce GTX 980 Ti",
        "G3Dmark": 13864,
        "Цена": 719.4,
        "Эффективность": 55.45,
        "Год": 2015,
        "Категория": "Desktop",
        "Саб Категория": "High-End"
    },
    {
        "Название": "Radeon RX 5600 XT",
        "G3Dmark": 13836,
        "Цена": 545,
        "Эффективность": 92.24,
        "Год": 2020,
        "Категория": "Desktop",
        "Саб Категория": "Mid-Range"
    },
    {
        "Название": "Radeon Vega Frontier Edition",
        "G3Dmark": 13748,
        "Цена": 1679.99,
        "Эффективность": 39.28,
        "Год": 2017,
        "Категория": "Desktop",
        "Саб Категория": "High-End"
    },
    {
        "Название": "RTX A2000 12GB",
        "G3Dmark": 13688,
        "Цена": 899.99,
        "Эффективность": 95.42,
        "Год": 2021,
        "Категория": "Workstation",
        "Саб Категория": "Professional"
    },
    {
        "Название": "GeForce RTX 2080 with Max-Q Design",
        "G3Dmark": 13681,
        "Цена": 2099.99,
        "Эффективность": 152.01,
        "Год": 2018,
        "Категория": "Mobile",
        "Саб Категория": "Gaming"
    },
    {
        "Название": "NVIDIA TITAN X",
        "G3Dmark": 13660,
        "Цена": 608.1,
        "Эффективность": 54.64,
        "Год": 2016,
        "Категория": "Desktop",
        "Саб Категория": "High-End"
    },
    {
        "Название": "Radeon RX Vega 56",
        "G3Dmark": 13636,
        "Цена": 752.99,
        "Эффективность": 64.93,
        "Год": 2017,
        "Категория": "Desktop",
        "Саб Категория": "High-End"
    },
    {
        "Название": "Quadro RTX 4000 with Max-Q Design",
        "G3Dmark": 13622,
        "Цена": 1499.99,
        "Эффективность": 170.27,
        "Год": 2019,
        "Категория": "Mobile",
        "Саб Категория": "Professional"
    },
    {
        "Название": "GeForce GTX 1070",
        "G3Dmark": 13482,
        "Цена": 342.55,
        "Эффективность": 89.88,
        "Год": 2016,
        "Категория": "Desktop",
        "Саб Категория": "Mid-Range"
    },
    {
        "Название": "RTX A3000 Laptop GPU",
        "G3Dmark": 13263,
        "Цена": 999.99,
        "Эффективность": 102.02,
        "Год": 2021,
        "Категория": "Mobile",
        "Саб Категория": "Professional"
    },
    {
        "Название": "Radeon Pro WX 9100",
        "G3Dmark": 13241,
        "Цена": 1499.99,
        "Эффективность": 57.57,
        "Год": 2017,
        "Категория": "Workstation",
        "Саб Категория": "Professional"
    },
    {
        "Название": "GeForce GTX TITAN X",
        "G3Dmark": 13173,
        "Цена": 1096.99,
        "Эффективность": 52.69,
        "Год": 2015,
        "Категория": "Desktop",
        "Саб Категория": "High-End"
    },
    {
        "Название": "RTX A2000",
        "G3Dmark": 13128,
        "Цена": 845.99,
        "Эффективность": 95.42,
        "Год": 2021,
        "Категория": "Workstation",
        "Саб Категория": "Professional"
    },
    {
        "Название": "GeForce GTX 1660 SUPER",
        "G3Dmark": 12732,
        "Цена": 329.99,
        "Эффективность": 101.85,
        "Год": 2019,
        "Категория": "Desktop",
        "Саб Категория": "Mid-Range"
    },
    {
        "Название": "GeForce RTX 3060 Laptop GPU",
        "G3Dmark": 12674,
        "Цена": 479.99,
        "Эффективность": 110.21,
        "Год": 2021,
        "Категория": "Mobile",
        "Саб Категория": "Gaming"
    },
    {
        "Название": "GeForce RTX 2070 (Mobile)",
        "G3Dmark": 12354,
        "Цена": 1199.99,
        "Эффективность": 107.43,
        "Год": 2018,
        "Категория": "Mobile",
        "Саб Категория": "Gaming"
    },
    {
        "Название": "Quadro P5200",
        "G3Dmark": 12144,
        "Цена": 1999.99,
        "Эффективность": 85.42,
        "Год": 2017,
        "Категория": "Workstation",
        "Саб Категория": "Professional"
    },
    {
        "Название": "GeForce RTX 2070 with Max-Q Design",
        "G3Dmark": 12062,
        "Цена": 1499.99,
        "Эффективность": 150.77,
        "Год": 2018,
        "Категория": "Mobile",
        "Саб Категория": "Gaming"
    },
    {
        "Название": "Quadro P5000",
        "G3Dmark": 11976,
        "Цена": 1868.99,
        "Эффективность": 66.54,
        "Год": 2016,
        "Категория": "Workstation",
        "Саб Категория": "Professional"
    },
    {
        "Название": "GeForce GTX 1660 Ti",
        "G3Dmark": 11794,
        "Цена": 349.99,
        "Эффективность": 98.29,
        "Год": 2019,
        "Категория": "Desktop",
        "Саб Категория": "Mid-Range"
    },
    {
        "Название": "GeForce GTX 1660",
        "G3Dmark": 11695,
        "Цена": 399.99,
        "Эффективность": 97.46,
        "Год": 2019,
        "Категория": "Desktop",
        "Саб Категория": "Mid-Range"
    },
    {
        "Название": "GeForce GTX 1080 with Max-Q Design",
        "G3Dmark": 11507,
        "Цена": 999.99,
        "Эффективность": 104.61,
        "Год": 2017,
        "Категория": "Mobile",
        "Саб Категория": "Gaming"
    },
    {
        "Название": "Quadro P4000",
        "G3Dmark": 11422,
        "Цена": 556.19,
        "Эффективность": 108.78,
        "Год": 2017,
        "Категория": "Workstation",
        "Саб Категория": "Professional"
    },
    {
        "Название": "Quadro M6000",
        "G3Dmark": 11397,
        "Цена": 1099.98,
        "Эффективность": 45.59,
        "Год": 2015,
        "Категория": "Workstation",
        "Саб Категория": "Professional"
    },
    {
        "Название": "GeForce RTX 2060 (Mobile)",
        "G3Dmark": 11355,
        "Цена": 999.99,
        "Эффективность": 141.93,
        "Год": 2019,
        "Категория": "Mobile",
        "Саб Категория": "Gaming"
    },
    {
        "Название": "GeForce GTX 980",
        "G3Dmark": 11237,
        "Цена": 247.35,
        "Эффективность": 68.1,
        "Год": 2014,
        "Категория": "Desktop",
        "Саб Категория": "High-End"
    },
    {
        "Название": "Quadro RTX 3000",
        "G3Dmark": 11122,
        "Цена": 999.99,
        "Эффективность": 139.03,
        "Год": 2019,
        "Категория": "Mobile",
        "Саб Категория": "Professional"
    },
    {
        "Название": "Tesla T4",
        "G3Dmark": 11113,
        "Цена": 4853.98,
        "Эффективность": 95.42,
        "Год": 2018,
        "Категория": "Workstation",
        "Саб Категория": "Professional"
    },
    {
        "Название": "GeForce GTX 1060",
        "G3Dmark": 10070,
        "Цена": 279.99,
        "Эффективность": 83.92,
        "Год": 2016,
        "Категория": "Desktop",
        "Саб Категория": "Mid-Range"
    },
    {
        "Название": "GeForce GTX 1650 SUPER",
        "G3Dmark": 10032,
        "Цена": 441.05,
        "Эффективность": 100.32,
        "Год": 2019,
        "Категория": "Desktop",
        "Саб Категория": "Mid-Range"
    },
    {
        "Название": "GeForce GTX 1050 Ti",
        "G3Dmark": 6314,
        "Цена": 189.42,
        "Эффективность": 84.18,
        "Год": 2016,
        "Категория": "Desktop",
        "Саб Категория": "Entry-Level"
    },
    {
        "Название": "GeForce GTX 1050",
        "G3Dmark": 5090,
        "Цена": 203.1,
        "Эффективность": 67.86,
        "Год": 2016,
        "Категория": "Desktop",
        "Саб Категория": "Entry-Level"
    },
    {
        "Название": "GeForce GT 1030",
        "G3Dmark": 2545,
        "Цена": 109.99,
        "Эффективность": 84.82,
        "Год": 2017,
        "Категория": "Desktop",
        "Саб Категория": "Entry-Level"
    }
];

export default  buildings;
